#include "Gravity.h"

/////////////////////////////////////////////////////
//引数			:落下させたいオブジェクトの最初のY座標
//戻り値		:なし
//動作			:値の初期化
/////////////////////////////////////////////////////
Gravity::Gravity(int startY)
{
	//初期座標
	y = startY;

	//初期化
	y_prev = y;
	y_temp = 0;
}

/////////////////////////////////////////////////////
//引数			:なし
//戻り値		:なし
//動作			:落下処理
/////////////////////////////////////////////////////
void Gravity::ObjGravity()
{
	if (y < 360)
	{
		//Verlet法
		//http://d.hatena.ne.jp/Gemma/20080517/1211010942
		y_temp = y;
		y += (y - y_prev) + 1;
		y_prev = y_temp;

		//位置調整
		if (y >= 360) y = 360;

	}
}